{
    "Hampton_Inn_Tropicana-Las_Vegas_Nevada": [
        "The rooms at the Palazzo are quite large with a separate sleeping area and sunken living room. The bathroom is also large, with a separate toilet room, double sinks, separate tub and shower. The bed was comfortable. Palazzo is a bit more quiet than its...More", 
        "Stayed for 6 nights in a standard suite, on lvl 36. \n\nThe room was nice and large, very comfortable and maintained. Great location on the strip as well. The casino was nice and there is a lot of food and drink options at the casino....More", 
        "Dear Chopstar87,\n\nThank you for visiting The Palazzo during your Las Vegas stay. I am delighted to know you found The Palazzo suites to be great! We hope you will consider staying with us on a future visit to Las Vegas!\n\nKind Regards, \n\n\nRoi Ebalo...More", 
        "I'd say my 2nd favorite hotel next to the Cosmopolitan.  I've stayed at the Venetian before, but never at the Palazzo.  Extremely large, spacious and beautifully appointed room.  So so quiet also. Everything is very comfortable from the bed to the couch, sheets are so...More", 
        "Dear VickieDOTcom,\n\nThank you very much for taking the time to share your positive experience. Every aspect of The Venetian | The Palazzo was created for the enjoyment of our guests, from our luxurious suites and beautifully re-created historic landmarks of Venice, Italy, to hand-painted...More", 
        "I make at least one trip to Las Vegas every year and I am not sure why I have never stayed at the Palazzo but I definitely will again.  The rooms are large, very clean and are as good or better than any in Vegas....More", 
        "Good afternoon Kirmack,\n\nThank you for sharing your wonderful experience on TripAdvisor.  I am pleased to read that The Venetian exceeded your expectations and provided you with unmatched service and accommodations.  We hope to now be your first choice when visiting Las Vegas. I look...More", 
        "We have been staying in Venetian's Suites for over 15 years. We were coming in this year for our 10 year wedding anniversary so I thought I would go for the \"upgrade\" at the Palazzo Prestige Suite.\nWe had to ask how to get to...More", 
        "Dear Resort23817014960,\n\nThank you very much for choosing to share feedback from your recent stay at The Venetian|Palazzo.  Having said that, please accept my sincere apologies for not properly exceeding your expectations during your stay with us.  I have forwarded the details of your stay...More"
    ]
}